Repository: klemens-morgenstern/doxygen
Catalog: translations/doxy_*.po
Languages: de, es, fr, it

# doxy-text|
source: All
de: Alle
es: Todos
fr: Tous

# doxy-text|
source: The documentation for this singleton was generated from the following files:
es: La documentación de este producto único se genera a partir de los siguientes archivos:
fr: La documentation de cette singleton a été générée à partir des fichiers suivants:

# doxy-text|
source: Date
de: Datum
es: Fecha

# doxy-text|
source: File
de: Datei
es: Archivo
fr: Fichier

# doxy-text|
source: Main Page
de: Hauptseite
es: Página principal
fr: Page principale

# doxy-text|
source: Note
de: Zu beachten
es: Nota

# doxy-text|
source: Page
de: Seite
es: Página

# doxy-text|
source: Test
es: Prueba

# doxy-text|
source: Todo
de: Noch zu erledigen
es: Hacer
fr: Faire

# doxy-text|
source: Type
de: Art
es: Escribe

# doxy-text|
source: %1 Service Reference
es: %1 Servicio de Referencia
fr: %1 Service de référence

# doxy-text|
source: code
es: código

# doxy-text|
source: file
de: dateien
es: archivos
fr: Fichier

# doxy-text|
source: page
de: seite
es: página

# doxy-text|
source: type
de: Art
es: escribe

# doxy-text|
source: Definition in file @0.
de: Definition in der Datei @0.
es: Definición en el archivo @0.
fr: Définition dans le fichier @0.

# doxy-text|
source: Public Types
de: Öffentliche Typen
es: Tipos Públicas
fr: Types publics

# doxy-text|
source: Public Slots
de: Geschützte Slots
es: Slots Públicas
fr: Slots publics

# doxy-text|
source: The documentation for this interface was generated from the following file:
de: Die Dokumentation für diese Schnittstelle wurde aus der folgenden Datei:
es: La documentación para esta interfaz se generó a partir del archivo siguiente:
fr: La documentation de cette interface a été générée à partir du fichier suivant:

# doxy-text|
source: Class
de: Klassen
es: Clase
fr: Classe

# doxy-text|
source: Enums
de: Aufzählungen
es: Enumeraciones

# doxy-text|
source: Files
de: Dateien
es: Archivos
fr: fichiers

# doxy-text|
source: defined in
de: Definiert in
es: definido en
fr: défini dans la

# doxy-text|
source: Index
es: Índice

# doxy-text|
source: Pages
de: Seiten
es: Páginas

# doxy-text|
source: Since
de: Seit
es: Desde
fr: Depuis

# doxy-text|
source: Types
de: Typen
es: Tipos

# doxy-text|
source: class
de: klasse
es: clase
fr: classe

# doxy-text|
source: files
de: dateien
es: archivos
fr: fichiers

# doxy-text|
source: Here is a list of all documented namespace members with links to the namespaces they belong to:
de: Hier ist eine Liste aller dokumentierten Namespace Mitglieder mit Links zu den Namespaces sie gehören:
es: Aquí está una lista de todos los miembros del espacio de nombres documentados con enlaces a los espacios de nombres a los que pertenecen:
fr: Voici une liste de tous les membres d'espace de noms documentées avec des liens vers les espaces de noms auxquels ils appartiennent:

# doxy-text|
source: pages
de: seiten
es: páginas

# doxy-text|
source: types
de: Typen
es: tipos

# doxy-text|
source: Member Typedef Documentation
de: Dokumentation der benutzerdefinierten Datentypen
es: Documentación de los 'Typedef' miembros de la clase
fr: Typedef membres Documentation

# doxy-text|
source: This graph shows which files directly or indirectly include this file
de: Dieser Graph zeigt, welche Datei direkt oder indirekt diese Datei enthält:
es: Este gráfico muestra qué archivos directamente o indirectamente incluyen este archivo
fr: Ce graphique montre quels fichiers directement ou indirectement comprennent ce dossier

# doxy-text|
source: The documentation for this interface was generated from the following file:
de: Die Dokumentation für diese Schnittstelle wurde aus der folgenden Datei:
es: La documentación para esta interfaz se generó a partir del archivo siguiente:
fr: La documentation de cette interface a été générée à partir du fichier suivant:

# doxy-text|
source: The documentation for this protocol was generated from the following files:
de: Die Dokumentation für diese Protokoll wurde von den folgenden Dateien generiert:
es: La documentación de este protocolo se genera a partir de los siguientes archivos:
fr: La documentation de ce protocole a été générée à partir des fichiers suivants:

# doxy-text|
source: Private Slots
es: Slots Privadas
fr: Connecteurs privés

# doxy-text|
source: Private Types
de: Private Typen
es: Tipos Privadas
fr: Types privées

# doxy-text|
source: Package Attributes
de: Paketattribute
es: Atributos del paquete
fr: Attributs de l'emballage

# doxy-text|
source: Protected Types
de: Geschützte Typen
es: Tipos Protegidas
fr: Types protégées

# doxy-text|
source: Protected Slots
de: Geschützte Slots
es: Slots Protegidas
fr: Slots protégées

# doxy-text|
source: This is an overloaded member function, provided for convenience. It differs from the above function only in what argument(s) it accepts.
de: Dies ist eine überladene Member-Funktion, für die Bequemlichkeit zur Verfügung gestellt. Es unterscheidet sich von der obigen Funktion nur in welchem ​​Argument(e) sie akzeptiert.
es: Se trata de una función miembro sobrecargada, proporcionado por conveniencia. Se diferencia de la función anterior sólo en lo que argumento (s) acepta.
fr: Ceci est une fonction membre surchargée, prévu pour plus de commodité. Elle diffère de la fonction ci-dessus seulement dans quel argument (s), il accepte.

# doxy-text|
source: Data Structure Documentation
de: Datenstruktur-Dokumentation
es: Estructura de datos Documentación
fr: Documentation des structures de données

# doxy-text|
source: Modules Index
de: Modul-Verzeichnis
es: Módulos Índice
fr: Indice de modules

# doxy-text|
source: Directory Hierarchy
de: Verzeichnishierarchie
es: Directorio Jerarquía
fr: Annuaire Hiérarchie

# doxy-text|
source: Package Types
de: Pakettypen
es: Tipos del paquete
fr: Types de l'emballage

# doxy-text|
source: Found <b>1</b> document matching your query.
de: Gefunden <b>1</b> Dokument für Ihre Abfrage.
es: Encontrado <b>1</b> documento coincidan con su consulta.
fr: Trouvé <b>1</b> Document correspondant à votre requête.

# doxy-text|
source: Constant Groups
es: Grupos constantes
fr: Groupes constants

# doxy-text|
source: Namespace List
de: Liste aller Namensbereiche
es: Lista Espacio de nombres
fr: Liste d'espace de noms

# doxy-text|
source: %1 Directory Reference
de: %1 Verzeichnis Reference
es: %1 Referencia Directorio
fr: %1 Répertoire de référence

# doxy-text|
source: Bibliography
de: Literaturverzeichnis
es: Bibliografía
fr: Bibliographie

# doxy-text|
source: Package %1
de: Paket %1
es: Paquete %1
fr: Forfait %1

# doxy-text|
source: The documentation for this union was generated from the following file:
de: Die Dokumentation für diese Vereinigung wurde aus der folgenden Datei:
es: La documentación de esta unión se generó a partir del archivo siguiente:
fr: La documentation de cette union a été générée à partir du fichier suivant:

# doxy-text|
source: Data Structures
de: Datenstrukturen
es: Estructuras de datos
fr: Structures de données

# doxy-text|
source: Here is a list of all examples:
de: Hier folgt eine Liste mit allen Beispielen:
es: Aquí está una lista de todos los ejemplos:
fr: Voici une liste de tous les exemples:

# doxy-text|
source: The documentation for this exception was generated from the following files:
de: Die Dokumentation für diese Ausnahme wurde aus den folgenden Dateien generiert:
es: La documentación de esta excepción se genera a partir de los siguientes archivos:
fr: La documentation de cette exception a été générée à partir des fichiers suivants:

# latexSupport|
source: remove-value
de: remove-Wert
es: \\usepackage[spanish]{babel}
fr: retirez-valeur

# doxy-text|
source: Graph Legend
de: Erklärung des Graphen
es: Gráfico Leyenda

# doxy-text|
source: %1 Template Reference
es: %1 Referencia Plantilla
fr: %1 Modèle de référence

# doxy-text|
source: Implements %1.
de: Implementiert %1.
es: Implementa %1.
fr: Met en œuvre %1.

# doxy-text|
source: Precondition
de: Vorbedingung
es: Condición previa
fr: Condition préalable

# doxy-text|
source: %1 Protocol Reference
es: %1 Protocolo de Referencia

# doxy-text|
source: %1 Protocol Reference
es: %1 Protocolo de Referencia
fr: %1 Protocole Référence

# doxy-text|
source: Protected Signals
de: Geschützte Signale
es: Señales Protegidas
fr: Signaux protégées

# doxy-text|
source: The documentation for this class was generated from the following files:
de: Die Dokumentation für diese Klasse wurde erzeugt aufgrund der Dateien:
es: La documentación para esta clase fue generada a partir de los siguientes archivos:
fr: La documentation de cette classe a été générée à partir des fichiers suivants:

# doxy-text|
source: Module Index
de: Modul-Verzeichnis
es: Indice de módulos
fr: Indice de Module

# doxy-text|
source: Field Documentation
de: Dokumentation der Datenelemente
es: Documentación de los campos
fr: Documentation des champs

# doxy-text|
source: %1 inherited from %2
de: %1 von geerbt %2
es: %1 heredado de %2
fr: %1 %2 hérité de

# doxy-text|
source: The documentation for this module was generated from the following files:
de: Die Dokumentation für dieses Modul wurde aus den folgenden Dateien generiert:
es: La documentación de este módulo se genera a partir de los siguientes archivos:
fr: La documentation de ce module a été générée à partir des fichiers suivants:

# doxy-text|
source: %1 Union Reference
es: %1 Unión de Referencia
fr: %1 référence de l'Union

# doxy-text|
source: Event Documentation
de: Ereignisdokumentation
es: Documentación Evento
fr: Documentation de l'événement

# doxy-text|
source: Hierarchical Index
de: Hierarchie-Verzeichnis
es: Indice jerárquico
fr: Index hiérarchique

# doxy-text|
source: The documentation for this union was generated from the following file:
de: Die Dokumentation für diese Vereinigung wurde aus der folgenden Datei:
es: La documentación de esta unión se generó a partir del archivo siguiente:
fr: La documentation de cette union a été générée à partir du fichier suivant:

# doxy-text|
source: Definition at line @0 of file @1.
de: Definiert in Zeile @0 von Datei @1.
es: Definición en la línea @0 de archivo @1.
fr: Définition à la ligne @0 du fichier @1.

# doxy-text|
source: Static Protected Attributes
de: Statische öffentliche Attribute
es: Atributos Protegidas estáticas
fr: Attributs protégés statiques

# doxy-text|
source: Function/Subroutine Documentation
de: Funktionen/Unterroutinen-Dokumentation
es: Función / subrutina Documentación
fr: Fonction / Subroutine Documentation

# doxy-text|
source: Method Documentation
de: Methodendokumentation
es: Método de Documentación
fr: Méthode Documentation

# doxy-text|
source: Here are the data structures with brief descriptions:
de: Hier folgt die Aufzählung aller Datenstrukturen mit einer Kurzbeschreibung:
es: Aquí están las estructuras de datos con una breve descripción:
fr: Voici les structures de données avec une brève description:

# doxy-text|
source: Public Signals
de: Öffentliche Signale
es: Señales Públicas
fr: Signaux

# doxy-text|
source: File List
de: Auflistung der Dateien
es: Lista de archivos
fr: Liste des fichiers

# doxy-text|
source: This directory hierarchy is sorted roughly, but not completely, alphabetically:
de: Diese Verzeichnishierarchie ist grob sortiert, aber nicht vollständig, alphabetischer Reihenfolge:
es: Esta jerarquía de directorios se ordena más o menos, pero no completamente, por orden alfabético:
fr: Cette hiérarchie de répertoire est triée en gros, mais pas complètement, par ordre alphabétique:

# doxy-text|
source: %1 Type Template Reference
de: %1 Typ Template Reference
es: %1 Referencia Plantilla Tipo
fr: %1 type de modèle de référence

# doxy-text|
source: Enumerator Documentation
es: Enumerador Documentación
fr: Recenseur Documentation

# doxy-text|
source: Initial value:
de: Initialisierung:
es: valor inicial:
fr: valeur initiale:

# doxy-text|
source: Inheritance diagram for %1:
de: Klassendiagramm für %1:
es: Diagrama de herencias de %1:
fr: Graphe d'héritage pour %1:

# doxy-text|
source: , and
de: Und
es: , Y
fr: Et

# doxy-text|
source: Go to the graphical class hierarchy
de: gehe zur grafischen Darstellung der Klassenhierarchie
es: Ir a la jerarquía de clases gráfica
fr: Aller à la hiérarchie de classe graphique

# doxy-text|
source: Here is a list of all documented data types members with links to the data structure documentation for each member:
de: Hier ist eine Liste aller dokumentierten Datentypen Elemente mit Verweisen auf die Datenstruktur der Dokumentation für jedes Mitglied:
es: Aquí está una lista de todos los tipos de datos documentados miembros con enlaces a la documentación de la estructura de datos para cada miembro:
fr: Voici une liste de tous les types de données documentées membres avec des liens vers la documentation de structure de données pour chaque membre:

# doxy-text|
source: The documentation for this singleton was generated from the following file:
de: Die Dokumentation für diese Singleton wurde aus der folgenden Datei:
es: La documentación de este producto único se generó a partir del archivo siguiente:
fr: La documentation de cette singleton a été générée à partir du fichier suivant:

# doxy-text|
source: Collaboration diagram for %1:
de: Kollaborationsdiagramm für% 1:
es: Diagrama de colaboración para %1:
fr: Graphe de collaboration de %1:

# doxy-text|
source: Here is a list of all documented struct and union fields with links to the struct/union documentation for each field:
de: Hier ist eine Liste aller dokumentierten struct und union Felder mit Verbindungen zum struct / union Dokumentation für jedes Feld:
es: Aquí está una lista de todos los campos de struct y sindicales documentados con enlaces a la documentación struct / union para cada campo:
fr: Voici une liste de tous les champs de struct et union documentés avec liens vers la documentation struct / union pour chaque champ:

# doxy-text|
source: Table of Contents
de: Inhaltsverzeichnis
es: tabla de contenidos
fr: table des matières

# doxy-text|
source: Package Functions
de: Paketfunktionen
es: Funciones del paquete
fr: Fonctions de l'emballage

# doxy-text|
source: Sorry, no documents matching your query.
de: Leider sind noch keine Dokumente gefunden, die Ihren Suchbegriffen.
es: Lo sentimos, no hay documentos que coincidan con su consulta.
fr: Désolé, aucun document correspondant à votre requête.

# doxy-text|
source: The documentation for this category was generated from the following files:
de: Die Dokumentation für diese Klasse wurde aus den folgenden Dateien generiert:
es: La documentación para esta categoría se genera a partir de los siguientes archivos:
fr: La documentation de cette catégorie a été générée à partir des fichiers suivants:

# doxy-text|
source: The documentation for this category was generated from the following file:
de: Die Dokumentation für diese Klasse wurde erzeugt aufgrund der Datei generiert:
es: La documentación para esta categoría se generó a partir del archivo siguiente:
fr: La documentation de cette catégorie a été générée à partir du fichier suivant:

# doxy-text|
source: Search Results
de: Suchergebnisse
es: Resultados De La Búsqueda
fr: Résultats De La Recherche

# doxy-text|
source: The documentation for this interface was generated from the following files:
de: Die Dokumentation für diese Schnittstelle wurde aus den folgenden Dateien generiert:
es: La documentación para esta interfaz se genera a partir de los siguientes archivos:
fr: La documentation de cette interface a été générée à partir des fichiers suivants:

# doxy-text|
source: Private Member Functions
de: Private Methoden
es: Funciones miembro privadas
fr: Fonctions membres privées

# doxy-text|
source: Data Types
de: Datentypen
es: Tipos De Datos
fr: Types de données

# doxy-text|
source: Public Member Functions
de: Öffentliche Methoden
es: Funciones miembros Pública
fr: Fonctions membres publiques

# doxy-text|
source: Static Package Functions
de: Statische Paketfunktionen
es: Funciones del paquete estáticas
fr: Fonctions de l'emballage statiques

# doxy-text|
source: Variable Documentation
de: Variablen-Dokumentation
es: Documentación Variable
fr: Documentation variable

# doxy-text|
source: No Matches
de: Keine Treffer
es: No Hay Coincidencias
fr: Pas De Correspondance

# doxy-text|
source: Members
de: Elemente
es: Miembros
fr: Membres

# doxy-text|
source: members
de: elemente
es: miembros
fr: membres

# doxy-text|
source: Static Public Member Functions
de: Öffentliche, statische Methoden
es: Estáticas funciones miembro públicas
fr: Fonctions membres publiques statiques

# doxy-text|
source: The documentation for this was generated from the following file:
de: Die Dokumentation für diese wurde aus der folgenden Datei:
es: La documentación para esta se generó a partir del archivo siguiente:
fr: La documentation de cette a été générée à partir du fichier suivant:

# doxy-text|
source: namespace
de: namensbereich
es: espacio de nombres

# doxy-text|
source: Namespace
de: Namensbereich
es: Espacio de nombres
fr: Espace de noms

# doxy-text|
source: The documentation for this protocol was generated from the following files:
de: Die Dokumentation für diese Protokoll wurde von den folgenden Dateien generiert:
es: La documentación de este protocolo se genera a partir de los siguientes archivos:
fr: La documentation de ce protocole a été générée à partir des fichiers suivants:

# doxy-text|
source: Postcondition
de: Nachbedingung
es: Condición posterior

# doxy-text|
source: Graphical Class Hierarchy
de: Grafische Darstellung der Klassenhierarchie
es: Jerarquía de la clase gráfica
fr: Graphique Hiérarchie des classes

# doxy-text|
source: Detailed Description
de: Ausführliche Beschreibung
es: Descripción detallada
fr: Description Détaillée

# doxy-text|
source: Here is a list of all files with brief descriptions:
de: Hier folgt die Aufzählung aller Dateien mit einer Kurzbeschreibung:
es: Aquí está una lista de todos los archivos con una breve descripción:
fr: Voici une liste de tous les fichiers avec une brève description:

# doxy-text|
source: Directory Documentation
de: Verzeichnisdokumentation
es: Documentación Directorio
fr: Répertoire Documentation

# doxy-text|
source: %1 Union Template Reference
es: %1 Referencia Plantilla Unión
fr: %1 Union Modèle de référence

# doxy-text|
source: Functions/Subroutines
es: Funciones / subrutinas
fr: Fonctions / sous-programmes

# doxy-text|
source: For internal use only.
de: Nur für den internen Gebrauch.
es: Sólo para uso interno.
fr: pour usage interne seulement.

# doxy-text|
source: Class Hierarchy
de: Klassenhierarchie
es: Jerarquía de la clase
fr: Hiérarchie des classes

# doxy-text|
source: Generated on %1 for %2 &nbsp; by
de: Erzeugt am %1 für %2 &nbsp; von
es: Generado en %1 para %2 &nbsp; por
fr: Généré le %1 pour %2 &nbsp; par

# doxy-text|
source: The documentation for this union was generated from the following files:
de: Die Dokumentation für diese Vereinigung wurde aus den folgenden Dateien generiert:
es: La documentación de esta unión se genera a partir de los siguientes archivos:
fr: La documentation de cette union a été générée à partir des fichiers suivants:

# doxy-text|
source: Modules
de: Module
es: Módulos

# doxy-text|
source: modules
de: gruppe
es: módulos

# doxy-text|
source: Function Documentation
de: Dokumentation der Funktionen
es: Documentación de las funciones
fr: Documentation des fonctions

# doxy-text|
source: More...
de: Mehr ...
es: Más...
fr: Plus...

# doxy-text|
source: Additional Inherited Members
de: Weitere Geerbte Elemente
es: Miembros heredados adicionales
fr: Les membres hérités supplémentaires

# doxy-text|
source: Data Fields
de: Datenstruktur-Elemente
es: Los campos de datos
fr: Champs de données

# doxy-text|
source: Namespace Index
de: Verzeichnis der Namensbereiche
es: Índice Espacio de nombres
fr: Indice de l'espace de noms

# doxy-text|
source: Here are the classes, structs, unions and interfaces with brief descriptions:
de: Hier folgt die Aufzählung aller Klassen, Strukturen, Varianten und Schnittstellen mit einer Kurzbeschreibung:
es: Aquí están las clases, estructuras, uniones e interfaces con una breve descripción:
fr: Voici les classes, structures, unions et interfaces avec de brèves descriptions:

# doxy-text|
source: Author
de: Autor
es: Autor
fr: Auteur

# doxy-text|
source: Functions
de: Funktionen
es: Funciones
fr: Fonctions

# doxy-text|
source: Namespace Documentation
de: Dokumentation der Namensbereiche
es: Espacio de nombres Documentación

# doxy-text|
source: Events
de: Ereignisse
es: Eventos
fr: Événements

# doxy-text|
source: Here is a list of all modules with brief descriptions:
de: Hier ist eine Liste aller Module mit einer kurzen Beschreibung:
es: Aquí está una lista de todos los módulos con una breve descripción:
fr: Voici une liste de tous les modules avec une brève description:

# doxy-text|
source: Class Documentation
de: Klassen-Dokumentation
es: Documentación Clase
fr: Documentation des classes

# doxy-text|
source: Enumeration Type Documentation
de: Dokumentation der Aufzählungstypen
es: Tipo Enumeración Documentación
fr: type d'énumération Documentation

# doxy-text|
source: Class Index
de: Klassen-Verzeichnis
es: Índice de Clase
fr: Index des classes

# doxy-text|
source: Here is a list of all functions, variables, defines, enums, and typedefs with links to the files they belong to:
de: Hier folgt die Aufzählung aller Funktionen, Variablen, Makros, Aufzählungen und Typdefinitionen mit Verweisen auf die Dokumentation zu jedem Element:
es: Aquí está una lista de todas las funciones, variables, define, enumeraciones y typedefs con enlaces a los archivos que pertenecen a:
fr: Voici une liste de toutes les fonctions, variables, définit, énumérations, et typedefs avec des liens vers les fichiers auxquels ils appartiennent:

# doxy-text|
source: Design Overview
de: Übersicht
es: Diseño general
fr: Aperçu de la conception

# doxy-text|
source: Member
de: Element
es: Miembro
fr: Membre

# doxy-text|
source: Module
de: Gruppe
es: Módulo

# doxy-text|
source: Module Documentation
de: Modul-Dokumentation
es: Módulo de Documentación
fr: Documentation des modules

# doxy-text|
source: %1 Class Template Reference
de: %1 Klasse Template Reference
es: %1 Referencia Plantilla Clase
fr: %1 Classe Modèle de référence

# doxy-text|
source: %1 Interface Template Reference
de: %1 Schnittstelle Template Reference
es: %1 Interface plantilla de referencia
fr: %1 Interface Modèle de référence

# doxy-text|
source: The documentation for this enum was generated from the following file:
de: Die Dokumentation für diese Enumeration wurde aus der folgenden Datei:
es: La documentación para esta enumeración se generó a partir del archivo siguiente:
fr: La documentation de cette énumération a été générée à partir du fichier suivant:

# doxy-text|
source: %1 Exception Template Reference
es: %1 Excepción Plantilla de Referencia
fr: %1 Exception Modèle de référence

# doxy-text|
source: Enum Values
de: Aufzählungswerte
es: Valores de enumeraciones
fr: Énumérer les valeurs

# doxy-text|
source: Page Documentation
de: Zusätzliche Informationen
es: Documentación de páginas

# doxy-text|
source: Search
de: Suchen
es: Buscar
fr: Recherche

# doxy-text|
source: %1 Module Template Reference
de: %1 Modul Template Reference
es: %1 Módulo Plantilla de Referencia
fr: %1 Module Modèle de référence

# doxy-text|
source: Generated automatically by DoxyPress from the source code.
de: Automatisch erzeugt von DoxyPress aus dem Quellcode.
es: Generado automáticamente por DoxyPress partir del código fuente.
fr: Généré automatiquement par DoxyPress à partir du code source.

# doxy-text|
source: Inherits %1.
de: Erbt %1.
es: Hereda %1.
fr: Hérite %1.

# doxy-text|
source: Value:
de: Wert:
es: Valor:
fr: Valeur:
