Repository: klemens-morgenstern/doxygen
Catalog: translations/doxy_*.po
Languages: de, es, fr, it

# doxy-text|
source: Here is a list of all documented file members with links to the files they belong to:
de: Hier folgt die Aufzählung aller dokumentierten Dateielemente mit Verweisen auf die Dokumentation zu jedem Element:
es: Aquí está una lista de todos los miembros de archivos documentados con enlaces a los archivos que pertenecen a:
fr: Voici une liste de tous les membres de fichiers documentés avec liens vers les fichiers auxquels ils appartiennent:

# doxy-text|
source: %1 Protocol Template Reference
es: %1 Referencia del Protocolo de Plantilla
fr: %1 Protocole modèle de référence

# doxy-text|
source: The documentation for this type was generated from the following file:
de: Die Dokumentation für diese Art wurde aus der folgenden Datei:
es: La documentación de este tipo se genera a partir del siguiente archivo:
fr: La documentation de ce type a été générée à partir du fichier suivant:

# doxy-text|
source: Go to the documentation of this file.
de: gehe zur Dokumentation dieser Datei
es: Ir a la documentación de este archivo.
fr: Aller à la documentation de ce fichier.

# doxy-text|
source: The documentation for this exception was generated from the following file:
de: Die Dokumentation für diese Ausnahme wurde aus der folgenden Datei:
es: La documentación de esta excepción se genera a partir del siguiente archivo:
fr: La documentation de cette exception a été générée à partir du fichier suivant:

# doxy-text|
source: Module Members
es: Módulo Miembros
fr: Membres du module

# doxy-text|
source: Here is a list of all documented modules with brief descriptions:
de: Hier ist eine Liste aller dokumentierten Module mit Kurzbeschreibungen:
es: Aquí está una lista de todos los módulos documentados con una breve descripción:
fr: Voici une liste de tous les modules documentées avec une brève description:

# doxy-text|
source: Directory dependency graph for %1:
de: Verzeichnis Abhängigkeitsdiagramm für %1:
es: Grafo de dependencias Directorio para %1:
fr: Annuaire Graphe des dépendances %1:

# doxy-text|
source: Data Structure Index
de: Datenstruktur-Verzeichnis
es: Estructura de datos Índice
fr: Index des structures de données

# doxy-text|
source: Data Types List
de: Datentyp-Liste
es: Lista de tipos de datos
fr: Liste des types de données

# doxy-text|
source: Here is a list of all documented files with brief descriptions:
de: Hier folgt die Aufzählung aller dokumentierten Dateien mit einer Kurzbeschreibung:
es: Aquí está una lista de todos los archivos documentados con una breve descripción:
fr: Voici une liste de tous les fichiers documentés avec une brève description:

# doxy-text|
source: author
de: autor
es: autor
fr: auteur

# doxy-text|
source: The documentation for this was generated from the following files:
de: Die Dokumentation für diese wurde aus den folgenden Dateien generiert:
es: La documentación para esta se genera a partir de los siguientes archivos:
fr: La documentation de cette a été générée à partir des fichiers suivants:

# doxy-text|
source: Example Documentation
de: Dokumentation der Beispiele
es: Documentación de ejemplos
fr: Exemple Documentation

# doxy-text|
source: Static Protected Member Functions
de: Geschützte, statische Methoden
es: Funciones estáticas miembros Protegidas
fr: Statiques Fonctions membres protégées

# doxy-text|
source: Properties
de: Propertys
es: Propiedades
fr: Propriétés

# doxy-text|
source: %1 Class Reference
de: %1 Klassenreferenz
es: %1 Referencia Clase
fr: %1 Référence de la classe

# doxy-text|
source: The documentation for this protocol was generated from the following file:
de: Die Dokumentation für diese Protokoll wurde von der folgenden Datei:
es: La documentación de este protocolo se generó a partir del archivo siguiente:
fr: La documentation de ce protocole a été générée à partir du fichier suivant:

# doxy-text|
source: legend
de: Legende
es: leyenda
fr: légende

# doxy-text|
source: Friends And Related Function Documentation
de: Freundbeziehungen und Funktionsdokumentation
es: Amigos y función Documentación relacionada
fr: Amis et la fonction Documentation connexe

# doxy-text|
source: member
de: element
es: miembro
fr: membre

# doxy-text|
source: module
de: gruppe
es: módulo

# doxy-text|
source: Page Index
de: Seitenindex
es: Índice Page
fr: Index Page

# doxy-text|
source: File Index
de: Datei-Verzeichnis
es: Índice de Archivo
fr: Index des fichiers

# doxy-text|
source: Static Public Attributes
de: Statische öffentliche Attribute
es: Atributos public static
fr: Attributs publics statiques

# doxy-text|
source: Included Services
de: Inkludierte Leistungen
es: Servicios Incluidos
fr: Services inclus

# doxy-text|
source: File in %1
de: Datei in %1
es: Archivo en %1
fr: Fichier %1

# doxy-text|
source: File Members
de: Datei-Elemente
es: Miembros de archivos
fr: Membres de fichier

# doxy-text|
source: Subprogram
de: Unterprogramm
es: Subprograma
fr: Sous-programme

# doxy-text|
source: subprogram
de: Unterprogramm
es: subprograma
fr: sous-programme

# doxy-text|
source: Packages
de: Pakete
es: Paquetes
fr: Forfaits

# doxy-text|
source: Here is a list of all modules:
de: Hier folgt die Aufzählung aller Module:
es: Aquí está una lista de todos los módulos:
fr: Voici une liste de tous les modules:

# doxy-text|
source: Private Attributes
de: Private Attribute
es: Atributos privados
fr: Attributs privées

# doxy-text|
source: Public Attributes
de: Öffentliche Attribute
es: Atributos Públicas
fr: Attributs publics

# doxy-text|
source: %1 Exception Reference
es: %1 Referencia Excepción
fr: Référence %1 d'exception

# doxy-text|
source: Copyright
es: Derechos de autor
fr: Droit d'auteur

# doxy-text|
source: and %1 more...
de: und %1 mehr ...
es: y %1 más ...
fr: et %1 plus ...

# doxy-text|
source: Package List
de: Paketliste
es: Lista del paquete
fr: Liste des paquets

# doxy-text|
source: Parameters
de: Parameter
es: Parámetros
fr: Paramètres

# doxy-text|
source: The documentation for this protocol was generated from the following file:
de: Die Dokumentation für diese Protokoll wurde von der folgenden Datei:
es: La documentación de este protocolo se generó a partir del archivo siguiente:
fr: La documentation de ce protocole a été générée à partir du fichier suivant:

# doxy-text|
source: Property Documentation
de: Dokumentation der Propertys
es: Documentación Propiedad
fr: Documentation de propriété

# doxy-text|
source: Typedef Documentation
de: Dokumentation der benutzerdefinierten Typen
es: Documentación de los 'typedefs'

# doxy-text|
source: Member Function Documentation
de: Dokumentation der Elementfunktionen
es: Documentación de las funciones miembro
fr: Documentation des fonctions membres

# doxy-text|
source: The documentation for this union was generated from the following files:
de: Die Dokumentation für diese Vereinigung wurde aus den folgenden Dateien generiert:
es: La documentación de esta unión se genera a partir de los siguientes archivos:
fr: La documentation de cette union a été générée à partir des fichiers suivants:

# doxy-text|
source: Template Parameters
de: Template-Parameter
es: Parámetros de plantilla
fr: Les paramètres de modèle

# doxy-text|
source: Matches:
de: Treffer:
es: Partidos:

# doxy-text|
source: This inheritance list is sorted roughly, but not completely, alphabetically:
de: Die Liste der Ableitungen ist -mit Einschränkungen- " "alphabetisch sortiert:
es: Esta lista está ordenada la herencia más o menos, pero no completamente, por orden alfabético:
fr: Cette liste d'héritage est triée en gros, mais pas complètement, par ordre alphabétique:

# doxy-text|
source: directory
de: verzeichnis
es: directorio
fr: annuaire

# doxy-text|
source: Directory
de: Verzeichnis
es: Directorio
fr: Annuaire

# doxy-text|
source: Deprecated
de: Veraltet
es: Obsoleto
fr: Obsolète

# doxy-text|
source: Remarks
de: Bemerkungen
es: Observaciones
fr: Remarques

# doxy-text|
source: Authors
de: Autoren
es: Autores
fr: Auteurs

# doxy-text|
source: Returns
de: Rückgabe
es: Devoluciones
fr: Résultats

# doxy-text|
source: %1 Module Reference
de: %1 Modul-Referenz
es: %1 Referencia Módulo
fr: %1 Module Référence

# doxy-text|
source: detail level
de: Detailebene
es: nivel de detalle
fr: niveau de détail

# doxy-text|
source: List of all members
de: Aufstellung aller Elemente
es: Lista de todos los miembros
fr: Liste de tous les membres

# doxy-text|
source: Data Type Documentation
de: Datentyp-Dokumentation
es: Tipo de datos de documentación
fr: Type de données Documentation

# doxy-text|
source: Here is a list of all documented namespaces with brief descriptions:
de: Liste aller dokumentierten Namensbereiche mit Kurzbeschreibung:
es: Aquí está una lista de todos los espacios de nombres documentados con breves descripciones:
fr: Voici une liste de tous les espaces de noms documentées avec une brève description:

# doxy-text|
source: Subprograms
de: Unterprogramme
es: Subprogramas
fr: Sous-programmes

# doxy-text|
source: Modules List
de: Modulliste
es: Lista de los módulos
fr: Liste des Modules

# doxy-text|
source: subprograms
de: Unterprogramme
es: subprogramas
fr: sous-programmes

# doxy-text|
source: The documentation for this interface was generated from the following files:
de: Die Dokumentation für diese Schnittstelle wurde aus den folgenden Dateien generiert:
es: La documentación para esta interfaz se genera a partir de los siguientes archivos:
fr: La documentation de cette interface a été générée à partir des fichiers suivants:

# doxy-text|
source: Here is a list of all struct and union fields with links to the structures/unions they belong to:
de: Hier ist eine Liste aller struct und union Felder mit Links zu den Strukturen / Vereinigungen, denen sie angehören:
es: Aquí está una lista de todos los campos de struct y sindicales con enlaces a las estructuras / sindicatos a los que pertenecen:
fr: Voici une liste de tous les champs de struct et union avec des liens vers les structures / syndicats auxquels ils appartiennent:

# doxy-text|
source: These are not member functions
de: Es handelt sich hierbei nicht um Elementfunktionen.
es: (Observar que estas no son funciones miembro.)
fr: Ce ne sont pas des fonctions membres

# doxy-text|
source: Private Signals
de: Private Signale
es: Señales Privadas
fr: Signaux privées

# doxy-text|
source: Reimplemented in %1.
de: In %1 neu implementiert.
es: Reimplementado en %1.
fr: Réimplémentée dans %1.

# doxy-text|
source: Public Typedefs
de: Öffentliche Typedefs
es: Typedefs Públicas
fr: Typedefs publics

# doxy-text|
source: Here is a list of all namespaces with brief descriptions:
de: Liste aller Namensbereiche mit Kurzbeschreibung:
es: Aquí está una lista de todos los espacios de nombres con descripciones breves:
fr: Voici une liste de tous les espaces de noms avec une brève description:

# doxy-text|
source: Instance Methods
de: Instanzmethoden
es: Métodos de instancia
fr: Méthodes d'instance

# doxy-text|
source: %1 Enum Reference
es: %1 Enum Referencia
fr: %1 Enum Référence

# doxy-text|
source: The documentation for this was generated from the following file:
de: Die Dokumentation für diese wurde aus der folgenden Datei:
es: La documentación para esta se generó a partir del archivo siguiente:
fr: La documentation de cette a été générée à partir du fichier suivant:

# doxy-text|
source: Here are the packages with brief descriptions (if available):
de: Hier folgen die Pakete mit einer Kurzbeschreibung (wenn verfügbar):
es: Aquí están los paquetes con breves descripciones (si están disponibles):
fr: Voici les paquets avec de courtes descriptions (si disponible):

# doxy-text|
source: Namespace Members
de: Elemente eines Namensbereiches
es: Espacio de nombres Miembros
fr: Membres espace de noms

# doxy-text|
source: Class Members
de: Klassen-Elemente
es: Miembros del Grupo
fr: Membres du Groupe

# doxy-text|
source: Reference Manual
de: Nachschlagewerk
es: Manual de referencia
fr: Manuel De Référence

# doxy-text|
source: Macro Definition Documentation
de: Makro-Dokumentation
es: Macro Definición Documentación
fr: Documentation Macro Definition

# doxy-text|
source: Static Private Member Functions
de: Private, statische Methoden
es: Estáticas funciones miembro privadas
fr: Statiques Fonctions membres privées

# doxy-text|
source: Class Methods
de: Klassenmethoden
es: Métodos de la Clase
fr: Méthodes de classe

# doxy-text|
source: Here is a list of all documented class members with links to the class documentation for each member:
de: Hier ist eine Liste aller dokumentierten die Schüler mit Links zu den Klassendokumentation für jedes Mitglied:
es: Aquí está una lista de todos los miembros de la clase documentados con enlaces a la documentación de la clase para cada miembro:
fr: Voici une liste de tous les membres de classe documentés avec liens vers la documentation de classe pour chaque membre:

# doxy-text|
source: %1 Category Template Reference
de: %1 Kategorie Template Reference
es: %1 Categoría Plantilla de Referencia
fr: %1 Catégorie Modèle de référence

# doxy-text|
source: Inherited by %1.
de: Von %1 geerbt.
es: Heredado por %1.
fr: Hérité par %1.

# doxy-text|
source: Here is a list of all class members with links to the classes they belong to:
de: Hier ist eine Liste aller Teilnehmer, mit Links zu den zugehörigen Klassen:
es: Aquí está una lista de todos los miembros de la clase con enlaces a las clases a las que pertenecen:
fr: Voici une liste de tous les membres de la classe avec des liens vers les classes auxquelles ils appartiennent:

# doxy-text|
source: The documentation for this module was generated from the following file:
de: Die Dokumentation für dieses Modul wurde aus der folgenden Datei:
es: La documentación de este módulo se generó a partir del archivo siguiente:
fr: La documentation de ce module a été générée à partir du fichier suivant:

# doxy-text|
source: File Documentation
de: Datei-Dokumentation
es: Documentación de archivos
fr: Documentation des fichiers

# doxy-text|
source: Classes
de: Klassen
es: Clases

# doxy-text|
source: classes
de: klassen
es: clases

# doxy-text|
source: %1 Source File
es: %1 Fuente Archivo
fr: Fichier %1 de Source

# doxy-text|
source: Static Package Attributes
de: Statische Paketattribute
es: Atributos del paquete estáticas
fr: Attributs de l'emballage statiques

# doxy-text|
source: Class List
de: Auflistung der Klassen
es: Lista de clase
fr: Liste des classes

# doxy-text|
source: Test List
de: Test-Liste
es: Lista de Prueba
fr: Liste d'essai

# doxy-text|
source: Reimplemented from %1.
de: Von %1 neu implementiert.
es: Reimplementado de %1.
fr: Réimplémentée à partir de %1

# doxy-text|
source: Member Function/Subroutine Documentation
de: Elementfunktionen/Unterroutinen-Dokumentation
es: Función Miembro / Documentación Subrutina
fr: Fonction de membres / Documentation Subroutine

# doxy-text|
source: Generated automatically by DoxyPress for %1 from the source code.
de: Automatisch erzeugt von DoxyPress für %1 aus dem Quellcode.
es: Generado automáticamente por DoxyPress para %1 desde el código fuente.
fr: Généré automatiquement par DoxyPress pour %1 à partir du code source.

# doxy-text|
source: Here is the caller graph for this function:
de: Hier ist ein Graph der zeigt, wo diese Funktion aufgerufen wird:
es: Aquí está el gráfico de llamadas para esta función:
fr: Voici le graphe d'appel pour cette fonction:

# doxy-text|
source: Attention
de: Achtung
es: Atención

# doxy-text|
source: directories
de: verzeichnisse
es: directorios
fr: répertoires

# doxy-text|
source: The documentation for this category was generated from the following file:
de: Die Dokumentation für diese Klasse wurde erzeugt aufgrund der Datei generiert:
es: La documentación para esta categoría se generó a partir del archivo siguiente:
fr: La documentation de cette catégorie a été générée à partir du fichier suivant:

# doxy-text|
source: Protected Attributes
de: Geschützte Attribute
es: Atributos Protegidas
fr: Attributs protégés

# doxy-text|
source: Directories
de: Verzeichnisse
es: Directorios
fr: Répertoires

# doxy-text|
source: Loading...
de: Lade ...
es: Cargando...
fr: Chargement ...

# doxy-text|
source: %1 Interface Reference
es: %1 Referencia de la interfaz
fr: %1 Référence de l'interface

# doxy-text|
source: Todo List
de: Ausstehende Aufgaben
es: Lista De Quehaceres
fr: Liste De Choses À Faire

# doxy-text|
source: Exported Interfaces
de: Exportierten Interfaces
es: Interfaces exportados
fr: Interfaces exportés

# doxy-text|
source: The documentation for this class was generated from the following file:
de: Die Dokumentation für diese Klasse wurde erzeugt aufgrund der Datei:
es: La documentación para esta clase fue generada a partir el archivo siguiente:
fr: La documentation de cette classe a été générée à partir du fichier suivant:

# doxy-text|
source: Include dependency graph for %1:
de: Include-Abhängigkeitsdiagramm für% 1:
es: Incluya la dependencia gráfico para %1:
fr: Inclure Graphe des dépendances %1:

# doxy-text|
source: click to enable panel synchronization
de: klicken Sie auf das Panel-Synchronisation aktivieren
es: haga clic para activar la sincronización del panel
fr: cliquez pour activer la synchronisation du panneau

# doxy-text|
source: Includes file in %1
de: Inklusive Datei in %1
es: Incluye archivo en %1
fr: Inclut le fichier %1

# doxy-text|
source: See also
de: Siehe auch
es: ver también
fr: voir aussi

# doxy-text|
source: %1 Struct Template Reference
es: %1 Struct Plantilla de Referencia
fr: %1 Struct Modèle de référence

# doxy-text|
source: Searching...
de: Suche ...
es: Buscando ...
fr: Recherche ...

# doxy-text|
source: Bug List
de: Liste der bekannten Fehler
es: Lista de bugs
fr: Liste des bogues

# doxy-text|
source: Member Data Documentation
de: Dokumentation der Datenelemente
es: Documentación de los datos miembro
fr: Documentation des membres

# doxy-text|
source: Global Namespace
de: Globaler Namensbereich
es: Espacio de nombres global
fr: Espace de noms global

# doxy-text|
source: Here is the call graph for this function:
de: Hier ist ein Graph, der zeigt, was diese Funktion aufruft:
es: Aquí está el gráfico de llamadas para esta función:
fr: Voici le graphe d'appel pour cette fonction:

# doxy-text|
source: The documentation for this service was generated from the following files:
de: Die Dokumentation für diese Dienstleistung wurde aus den folgenden Dateien generiert:
es: La documentación de este servicio se genera a partir de los siguientes archivos:
fr: La documentation de ce service a été générée à partir des fichiers suivants:

# doxy-text|
source: enum name
de: enum-Bezeichner
es: nombre de la enumeración
fr: nom d'énumération

# doxy-text|
source: %1 Relation
de: %1 Verhältnis
es: %1 Relación

# doxy-text|
source: Member List
de: Elementverzeichnis
es: Lista de los miembros
fr: Liste des membres

# doxy-text|
source: Referenced by
de: Wird benutzt von
es: Referenciado por
fr: Référencé par

# doxy-text|
source: This is the complete list of members for
de: Vollständige Aufstellung aller Elemente für
es: Lista completa de los miembros de
fr: Ceci est la liste complète des membres de

# doxy-text|
source: Generated on %1 &nbsp; by
de: Erzeugt am %1 &nbsp; von
es: Generado en %1 &nbsp; por
fr: Généré le %1 &nbsp; par

# doxy-text|
source: Generated by
de: Erzeugt von
es: generado por
fr: généré par

# doxy-text|
source: The documentation for this was generated from the following files:
de: Die Dokumentation für diese wurde aus den folgenden Dateien generiert:
es: La documentación para esta se genera a partir de los siguientes archivos:
fr: La documentation de cette a été générée à partir des fichiers suivants:

# doxy-text|
source: Exceptions
de: Ausnahmebehandlung
es: Excepciones

# doxy-text|
source: %1 Type Reference
es: %1 Tipo de Referencia
fr: %1 Type Référence

# doxy-text|
source: Invariant
de: Invariante
es: Invariante

# doxy-text|
source: References
de: Benutzt
es: Referencias
fr: Références

# doxy-text|
source: namespaces
de: namensbereichn
es: espacios de nombres

# doxy-text|
source: Namespaces
de: Namensbereiche
es: Los espacios de nombres
fr: Espaces de noms

# doxy-text|
source: %1 File Reference
de: %1-Dateireferenz
es: %1 Referencia Archivo
fr: %1 Référence du fichier

# doxy-text|
source: Version
es: Versión

# doxy-text|
source: Type Constraints
es: Tipo Restricciones
fr: Type de Contraintes

# doxy-text|
source: The documentation for this struct was generated from the following file:
de: Die Dokumentation für diese Struktur wurde erzeugt aufgrund der Datei:
es: La documentación para esta estructura fue generada a partir el archivo siguiente:
fr: La documentation de cette structure a été générée à partir du fichier suivant:

# doxy-text|
source: Here is a list of all documented file members with links to the documentation:
de: Hier folgt die Aufzählung aller dokumentierten Dateielemente mit Verweisen auf die zugehörigen Dateien:
es: Aquí está una lista de todos los miembros de archivos documentados con enlaces a la documentación:
fr: Voici une liste de tous les membres de fichiers documentés avec liens vers la documentation:

# doxy-text|
source: Private Typedefs
es: Typedefs Privadas
fr: Typedefs privées

# doxy-text|
source: Deprecated List
de: Veraltete Elemente
es: Lista Obsoleto
fr: Liste obsolète

# doxy-text|
source: Constructor & Destructor Documentation
es: Constructor y destructor de documentación
fr: Documentation des constructeurs et destructeur

# doxy-text|
source: Here is a list of all namespace members with links to the namespace documentation for each member:
de: Hier ist eine Liste aller Namespace Mitglieder mit Links zu den Namespace-Dokumentation für jedes Mitglied:
es: Aquí está una lista de todos los miembros de espacio de nombres con enlaces a la documentación de espacio de nombres para cada miembro:
fr: Voici une liste de tous les membres d'espace de noms avec des liens vers la documentation d'espace de noms pour chaque membre:

# doxy-text|
source: Return Values
de: Rückgabewerte
es: Valores devueltos
fr: Valeurs retournées

# doxy-text|
source: Static Private Attributes
de: Statische, private Attribute
es: Atributos privados estáticas
fr: Attributs privés statiques

# doxy-text|
source: Data Type Index
de: Datentyp-Index
es: Índice de Tipo de datos
fr: Type de données Index

# doxy-text|
source: Warning
de: Warnung
es: Advertencia
fr: Attention

# doxy-text|
source: Friends
de: Freundbeziehungen
es: Amigos
fr: Amis

# doxy-text|
source: Implemented %1.
de: Implementiert %1.
es: Implementado %1.
fr: Mise en œuvre %1.

# doxy-text|
source: click to disable panel synchronization
de: klicken Sie auf das Panel-Synchronisation zu deaktivieren
es: haga clic para desactivar la sincronización del panel
fr: cliquez pour désactiver la synchronisation du panneau

# doxy-text|
source: %1 Singleton Reference
es: %1 Singleton Referencia
fr: %1 Singleton Référence

# doxy-text|
source: The documentation for this service was generated from the following file:
de: Die Dokumentation für diese Dienstleistung wurde aus der folgenden Datei:
es: La documentación de este servicio se generó a partir del archivo siguiente:
fr: La documentation de ce service a été générée à partir du fichier suivant:

# doxy-text|
source: The documentation for this struct was generated from the following files:
de: Die Dokumentation für diese Struktur wurde erzeugt aufgrund der Dateien:
es: La documentación para esta estructura se genera a partir de los siguientes archivos:
fr: La documentation de cette structure a été générée à partir des fichiers suivants:
