Repository: klemens-morgenstern/doxygen
Catalog: translations/doxy_*.po
Languages: de, es, fr, it

# doxy-text
source: The documentation for this category was generated from the following file:
it: La documentazione per questa categoria è stata generata dal seguente file:

# doxy-text
source: Search Results
it: Risultati Di Ricerca

# doxy-text
source: The documentation for this interface was generated from the following files:
it: La documentazione di questa interfaccia è stata generata dai seguenti file:

# doxy-text
source: Private Member Functions
it: Utente privati ​​Funzioni

# doxy-text
source: Data Types
it: Tipi di dati

# doxy-text
source: Public Member Functions
it: Membri pubblici

# doxy-text
source: Static Package Functions
it: Funzioni pacchetti statici

# doxy-text
source: Variable Documentation
it: Variabile Documentazione

# doxy-text
source: No Matches
it: Nessun Risultato

# doxy-text
source: Members
it: Membri

# doxy-text
source: members
it: membri

# doxy-text
source: Static Public Member Functions
it: Statici Membri pubblici

# doxy-text
source: The documentation for this was generated from the following file:
it: La documentazione per questa è stata generata da il seguente file:

# doxy-text
source: The documentation for this protocol was generated from the following files:
it: La documentazione di questo protocollo è stata generata dai seguenti file:

# doxy-text
source: Postcondition
it: Post-

# doxy-text
source: Graphical Class Hierarchy
it: Graphical Gerarchia delle classi

# doxy-text
source: Detailed Description
it: Descrizione Dettagliata

# doxy-text
source: Here is a list of all files with brief descriptions:
it: Ecco un elenco di tutti i file con brevi descrizioni:

# doxy-text
source: Directory Documentation
it: Directory Documentazione

# doxy-text
source: %1% Union Template Reference
it: %1% Union modello di riferimento

# doxy-text
source: Functions/Subroutines
it: Funzioni / subroutine

# doxy-text
source: For internal use only.
it: solo per uso interno.

# doxy-text
source: Class Hierarchy
it: Gerarchia delle classi

# doxy-text
source: Generated on %1% for %2% &nbsp; by
it: Generato il %1% per %2% &nbsp; da

# doxy-text
source: The documentation for this union was generated from the following files:
it: La documentazione di questa unione è stata generata dai seguenti file:

# doxy-text
source: Modules
it: Moduli

# doxy-text
source: modules
it: Moduli

# doxy-text
source: Function Documentation
it: Funzione Documentazione

# doxy-text
source: More...
it: Di Più...

# doxy-text
source: Additional Inherited Members
it: Ulteriori membri ereditati

# doxy-text
source: Data Fields
it: Campi dati

# doxy-text
source: Namespace Index
it: Indice dei nomi

# doxy-text
source: Here are the classes, structs, unions and interfaces with brief descriptions:
it: Qui ci sono le classi, le strutture, i sindacati e le interfacce con brevi descrizioni:

# doxy-text
source: Author
it: Autore

# doxy-text
source: Functions
it: Funzioni

# doxy-text
source: Namespace Documentation
it: Namespace Documentazione

# doxy-text
source: Events
it: Eventi

# doxy-text
source: Here is a list of all modules with brief descriptions:
it: Ecco un elenco di tutti i moduli con brevi descrizioni:

# doxy-text
source: Class Documentation
it: Classe Documentazione

# doxy-text
source: Global
it: Globale

# doxy-text
source: Here is a list of all functions, variables, defines, enums, and typedefs with links to the files they belong to:
it: Ecco un elenco di tutte le funzioni, le variabili, definisce, enumerazioni, e typedef con link ai file che appartengono a:

# doxy-text
source: Design Overview
it: Design Descrizione

# doxy-text
source: Macros
it: Macro

# doxy-text
source: Member
it: Membro

# doxy-text
source: Module
it: Modulo

# doxy-text
source: Module Documentation
it: Modulo Documentazione

# doxy-text
source: %1% Class Template Reference
it: %1% Classe modello di riferimento

# doxy-text
source: %1% Interface Template Reference
it: %1% Interfaccia modello di riferimento

# doxy-text
source: The documentation for this enum was generated from the following file:
it: La documentazione per questa enumerazione è stata generata dal seguente file:

# doxy-text
source: %1% Exception Template Reference
it: %1% Eccezione modello di riferimento

# doxy-text
source: Enum Values
it: Valori Enum

# doxy-text
source: Page Documentation
it: Pagina Documentazione

# doxy-text
source: Search
it: Ricerca

# doxy-text
source: %1% Module Template Reference
it: %1% Modulo Template Reference

# doxy-text
source: Generated automatically by DoxyPress from the source code.
it: Generato automaticamente DoxyPress dal codice sorgente.

# doxy-text
source: Inherits %1%.
it: Eredita %1%.

# doxy-text
source: Value:
it: Valore:

# doxy-text
source: Here is a list of all documented file members with links to the files they belong to:
it: Ecco un elenco di tutti i membri di file documentati con link ai file che appartengono a:

# doxy-text
source: %1% Protocol Template Reference
it: %1% Protocollo modello di riferimento

# doxy-text
source: The documentation for this type was generated from the following file:
it: La documentazione di questo tipo è stata generata dal seguente file:

# doxy-text
source: Go to the documentation of this file.
it: Andare alla documentazione di questo file.

# doxy-text
source: The documentation for this exception was generated from the following file:
it: La documentazione per questa eccezione è stata generata da il seguente file:

# doxy-text
source: Module Members
it: Membri del modulo

# doxy-text
source: Here is a list of all documented modules with brief descriptions:
it: Ecco un elenco di tutti i moduli documentati con brevi descrizioni:

# doxy-text
source: Directory dependency graph for %1%:
it: Grafico delle dipendenze Directory per %1%:

# doxy-text
source: Data Structure Index
it: Indice Struttura dati

# doxy-text
source: Data Types List
it: Elenco dei tipi di dati

# doxy-text
source: Here is a list of all documented files with brief descriptions:
it: Ecco un elenco di tutti i file documentati con brevi descrizioni:

# doxy-text
source: author
it: autore

# doxy-text
source: The documentation for this was generated from the following files:
it: La documentazione per questa è stata generata dai seguenti file:

# doxy-text
source: Example Documentation
it: Esempio Documentazione

# doxy-text
source: Static Protected Member Functions
it: Statici funzioni membro protette

# doxy-text
source: Properties
it: Proprietà

# doxy-text
source: global
it: globale

# doxy-text
source: %1% Class Reference
it: %1% Classe di riferimento

# doxy-text
source: The documentation for this protocol was generated from the following file:
it: La documentazione di questo protocollo è stata generata dal seguente file:

# doxy-text
source: legend
it: leggenda

# doxy-text
source: Friends And Related Function Documentation
it: Friends And Funzione Documentazione correlata

# doxy-text
source: member
it: membro

# doxy-text
source: module
it: modulo

# doxy-text
source: Page Index
it: Index Page

# doxy-text
source: File Index
it: Index File

# doxy-text
source: Static Public Attributes
it: Attributi public static

# doxy-text
source: Included Services
it: Servizi Inclusi

# doxy-text
source: File Members
it: Membri di file

# doxy-text
source: Subprogram
it: Sottoprogramma

# doxy-text
source: subprogram
it: sottoprogramma

# doxy-text
source: Packages
it: Pacchetti

# doxy-text
source: Here is a list of all modules:
it: Ecco un elenco di tutti i moduli:

# doxy-text
source: Private Attributes
it: Attributi privati

# doxy-text
source: Public Attributes
it: Attributi pubblici

# doxy-text
source: %1% Exception Reference
it: %1% Eccezione di riferimento

# doxy-text
source: Copyright
it: Diritto D'autore

# doxy-text
source: and %1% more...
it: e %1% in più di...

# doxy-text
source: Package List
it: Lista del pacchetto

# doxy-text
source: Parameters
it: Parametri

# doxy-text
source: The documentation for this protocol was generated from the following file:
it: La documentazione di questo protocollo è stata generata dal seguente file:

# doxy-text
source: Property Documentation
it: Documentazione Proprietà

# doxy-text
source: Typedef Documentation
it: Typedef Documentazione

# doxy-text
source: Member Function Documentation
it: Documentazione delle funzioni membro

# doxy-text
source: The documentation for this union was generated from the following files:
it: La documentazione di questa unione è stata generata dai seguenti file:

# doxy-text
source: Template Parameters
it: Parametri di modello

# doxy-text
source: Matches:
it: Partite:

# doxy-text
source: This inheritance list is sorted roughly, but not completely, alphabetically:
it: Questo elenco di ereditarietà è ordinato o meno, ma non completamente, in ordine alfabetico:

# doxy-text
source: directory
it: elenco

# doxy-text
source: Directory
it: Elenco

# doxy-text
source: Deprecated
it: Sconsigliata

# doxy-text
source: Remarks
it: Osservazioni

# doxy-text
source: Authors
it: Autori

# doxy-text
source: Returns
it: Restituisce

# doxy-text
source: %1% Module Reference
it: %1% Modulo di riferimento

# doxy-text
source: detail level
it: livello di dettaglio

# doxy-text
source: List of all members
it: Elenco di tutti i membri

# doxy-text
source: Variables
it: Variabili

# doxy-text
source: Data Type Documentation
it: Tipo di dati Documentazione

# doxy-text
source: Here is a list of all documented namespaces with brief descriptions:
it: Ecco un elenco di tutti gli spazi dei nomi documentate con brevi descrizioni:

# doxy-text
source: Subprograms
it: Sottoprogrammi

# doxy-text
source: Modules List
it: Elenco dei moduli

# doxy-text
source: subprograms
it: sottoprogrammi

# doxy-text
source: The documentation for this interface was generated from the following files:
it: La documentazione di questa interfaccia è stata generata dai seguenti file:

# doxy-text
source: Here is a list of all struct and union fields with links to the structures/unions they belong to:
it: Ecco un elenco di tutti i campi struct e sindacali con collegamenti alle strutture / sindacati di appartenenza:

# doxy-text
source: These are not member functions
it: Queste non sono funzioni membro

# doxy-text
source: Private Signals
it: Segnali privati

# doxy-text
source: Reimplemented in %1%.
it: Reimplementato in %1%.

# doxy-text
source: Public Typedefs
it: Typedef pubblici

# doxy-text
source: Here is a list of all namespaces with brief descriptions:
it: Ecco un elenco di tutti gli spazi dei nomi con brevi descrizioni:

# doxy-text
source: Instance Methods
it: Metodi di istanza

# doxy-text
source: %1% Enum Reference
it: %1% Enum riferimento

# doxy-text
source: The documentation for this was generated from the following file:
it: La documentazione per questa è stata generata da il seguente file:

# doxy-text
source: Here are the packages with brief descriptions (if available):
it: Qui ci sono i pacchetti con brevi descrizioni (se disponibile):

# doxy-text
source: Namespace Members
it: Spazio dei nomi

# doxy-text
source: Class Members
it: Classe Membri

# doxy-text
source: Reference Manual
it: Manuale Di Riferimento

# doxy-text
source: Macro Definition Documentation
it: Definizione Documentazione Macro

# doxy-text
source: Static Private Member Functions
it: Statici utente privati ​​Funzioni

# doxy-text
source: Class Methods
it: I metodi di classe

# doxy-text
source: Here is a list of all documented class members with links to the class documentation for each member:
it: Ecco un elenco di tutti i membri della classe documentati con collegamenti alla documentazione di classe per ogni membro:

# doxy-text
source: %1% Category Template Reference
it: %1% Categoria Template Reference

# doxy-text
source: Inherited by %1%.
it: Ereditato da %1%.

# doxy-text
source: Here is a list of all class members with links to the classes they belong to:
it: Ecco un elenco di tutti i membri della classe con collegamenti alle classi a cui appartengono:

# doxy-text
source: The documentation for this module was generated from the following file:
it: La documentazione di questo modulo è stato generato dal seguente file:

# doxy-text
source: File Documentation
it: Documentazione File

# doxy-text
source: Classes
it: Classi

# doxy-text
source: classes
it: classi

# doxy-text
source: %1% Source File
it: %1% Fonte File

# doxy-text
source: Static Package Attributes
it: Attributi pacchetti statici

# doxy-text
source: Class List
it: Elenco Class

# doxy-text
source: Test List
it: Elenco test

# doxy-text
source: Reimplemented from %1%.
it: Reimplementato da %1%.

# doxy-text
source: Member Function/Subroutine Documentation
it: Gli Funzione / subroutine Documentazione

# doxy-text
source: Generated automatically by DoxyPress for %1% from the source code.
it: Generato automaticamente da DoxyPress per %1% dal codice sorgente.

# doxy-text
source: Here is the caller graph for this function:
it: Ecco il grafico chiamante per questa funzione:

# doxy-text
source: Attention
it: Attenzione

# doxy-text
source: directories
it: directory

# doxy-text
source: The documentation for this category was generated from the following file:
it: La documentazione per questa categoria è stata generata dal seguente file:

# doxy-text
source: Protected Attributes
it: Attributi protette

# doxy-text
source: Directories
it: Elenchi

# doxy-text
source: Loading...
it: Caricamento in corso ...

# doxy-text
source: %1% Interface Reference
it: %1% Interfaccia di riferimento

# doxy-text
source: Todo List
it: Lista Di Cose Da Fare

# doxy-text
source: Exported Interfaces
it: Interfacce esportati

# doxy-text
source: The documentation for this class was generated from the following file:
it: La documentazione per questa classe è stata generata dal seguente file:

# doxy-text
source: Include dependency graph for %1%:
it: Includere dipendenza grafico per %1%:

# doxy-text
source: click to enable panel synchronization
it: fai clic per abilitare la sincronizzazione pannello

# doxy-text
source: Includes file in %1%
it: Include il file in %1%

# doxy-text
source: See also
it: Guarda anche

# doxy-text
source: %1% Struct Template Reference
it: %1% struct modello di riferimento

# doxy-text
source: Searching...
it: Ricerca in corso ...

# doxy-text
source: Bug List
it: Elenco Bug

# doxy-text
source: Member Data Documentation
it: Documentazione membro dati

# doxy-text
source: Global Namespace
it: Namespace globale

# doxy-text
source: Here is the call graph for this function:
it: Ecco il grafo delle chiamate per questa funzione:

# doxy-text
source: The documentation for this service was generated from the following files:
it: La documentazione per questo servizio è stata generata dai seguenti file:

# doxy-text
source: enum name
it: nome enum

# doxy-text
source: Member List
it: Lista utenti

# doxy-text
source: Referenced by
it: Citato da

# doxy-text
source: This is the complete list of members for
it: Questa è la lista completa dei membri per

# doxy-text
source: Generated on %1% &nbsp; by
it: Generato il %1% &nbsp; da

# doxy-text
source: Generated by
it: generato da

# doxy-text
source: The documentation for this was generated from the following files:
it: La documentazione per questa è stata generata dai seguenti file:

# doxy-text
source: Exceptions
it: Eccezioni

# doxy-text
source: %1% Type Reference
it: %1% Tipo di riferimento

# doxy-text
source: Invariant
it: Invariante

# doxy-text
source: References
it: Riferimenti

# doxy-text
source: namespaces
it: spazi dei nomi

# doxy-text
source: Namespaces
it: Namespace

# doxy-text
source: %1% File Reference
it: %1% Reference File

# doxy-text
source: Version
it: Versione

# doxy-text
source: Type Constraints
it: Tipo Vincoli

# doxy-text
source: The documentation for this struct was generated from the following file:
it: La documentazione per questa struct è stata generata dal seguente file:

# doxy-text
source: Here is a list of all documented file members with links to the documentation:
it: Ecco un elenco di tutti i membri di file documentati con collegamenti alla documentazione:

# doxy-text
source: Private Typedefs
it: Typedef privati

# doxy-text
source: Deprecated List
it: Elenco Sconsigliata

# doxy-text
source: Constructor & Destructor Documentation
it: Constructor & Destructor Documentazione

# doxy-text
source: Here is a list of all namespace members with links to the namespace documentation for each member:
it: Ecco un elenco di tutti i membri dello spazio dei nomi con i collegamenti alla documentazione spazio dei nomi per ciascun membro:

# doxy-text
source: Return Values
it: Valori restituiti

# doxy-text
source: Static Private Attributes
it: Statici attributi privati

# doxy-text
source: Data Type Index
it: Tipo di dati Indice

# doxy-text
source: Warning
it: Avvertimento

# doxy-text
source: Friends
it: Amici

# doxy-text
source: Implemented %1%.
it: Implementato %1%.

# doxy-text
source: click to disable panel synchronization
it: fai clic per disattivare la sincronizzazione pannello

# doxy-text
source: %1% Singleton Reference
it: %1% Singleton riferimento

# doxy-text
source: The documentation for this service was generated from the following file:
it: La documentazione per questo servizio è stata generata dal seguente file:

# doxy-text
source: The documentation for this struct was generated from the following files:
it: La documentazione per questa struct è stata generata dai seguenti file:

# doxy-text
source: Found <b>$num</b> documents matching your query. Showing best matches first.
it: Trovato <b>$num </b> i documenti corrispondenti alla tua ricerca. Mostrando prima migliori partite.

# doxy-text
source: Member Enumeration Documentation
it: Gli Enumeration Documentazione

# doxy-text
source: , including all inherited members.
it: , Compresi tutti i membri ereditati.

# doxy-text
source: Related Functions
it: Funzioni correlate

# doxy-text
source: %1% Reference
it: %1% di riferimento

# doxy-text
source: Protected Member Functions
it: Funzioni membro protette

# doxy-text
source: Here is a list of all documented module members with links to the modules they belong to:
it: Ecco un elenco di tutti i membri del modulo documentati con link ai moduli a cui appartengono:

# doxy-text
source: This page explains how to interpret the graphs which are generated by DoxyPress. Consider the following example: \code /*! Invisible class because of truncation */ class Invisible { }; /*! Truncated class, inheritance relation is hidden */ class Truncated : public Invisible { }; /* Class not documented with DoxyPress comments */ class Undocumented { }; /*! Class that is inherited using public inheritance */ class PublicBase : public Truncated { }; /*! A template class */ template<class T> class Templ { }; /*! Class that is inherited using protected inheritance */ class ProtectedBase { }; /*! Class that is inherited using private inheritance */ class PrivateBase { }; /*! Class that is used by the Inherited class */ class Used { }; /*! Super class that inherits a number of other classes */ class Inherited : public PublicBase, protected ProtectedBase, private PrivateBase, public Undocumented, public Templ<int> { private: Used *m_usedClass; }; \endcode This will result in the following graph: <center><img alt="" src="graph_legend.%1%"></center> The boxes in the above graph have the following meaning: <ul> <li>%A filled gray box represents the struct or class for which the graph is generated.</li> <li>%A box with a black border denotes a documented struct or class.</li> <li>%A box with a grey border denotes an undocumented struct or class.</li> <li>%A box with a red border denotes a documented struct or class for which not all inheritance/containment relations are shown. %A graph is truncated if it does not fit within the specified boundaries.</li> </ul> The arrows have the following meaning: <ul> <li>%A dark blue arrow is used to visualize a public inheritance relation between two classes.</li> <li>%A dark green arrow is used for protected inheritance.</li> <li>%A dark red arrow is used for private inheritance.</li> <li>%A purple dashed arrow is used if a class is contained or used by another class. The arrow is labeled with the variable(s) through which the pointed class or struct is accessible.</li> <li>%A yellow dashed arrow denotes a relation between a template instance and the template class it was instantiated from. The arrow is labeled with the template parameters of the instance.</li> </ul>
it: Questa pagina spiega come interpretare i grafici generati da DoxyPress. Si consideri il seguente esempio: \code /*! Invisibile classe a causa di troncamento */ class Invisible { }; /*! Classe troncato, relazione eredità è nascosto */ class Truncated : public Invisible { }; /* Classe non documentato con DoxyPress commenti */ class Undocumented { }; /*! Classe che è ereditato con l'ereditarietà pubblica */ class PublicBase : public Truncated { }; /*! Una classe template */ template<class T> class Templ { }; /*! Classe che è ereditato utilizzando protetto eredità */ class ProtectedBase { }; /*! Classe che è ereditato con ereditarietà privata */ class PrivateBase { }; /*! Class che viene utilizzato dalla classe Inherited */ class Used {}; /*! Classe Super che eredita un certo numero di altre classi */ class Inherited : public PublicBase, protected ProtectedBase, private PrivateBase, public Undocumented, public Templ<int> { private: Used *m_usedClass; }; \endcode Questo si tradurrà nel grafico seguente: <center><img alt="" src="graph_legend.%1% "></center> Le caselle nel grafico sopra hanno il seguente significato: <ul> <li>%Una scatola grigia piena rappresenta la struttura o classe per la quale viene generato il grafico. </li> <li>%Una scatola con un bordo nero denota una struttura o classe indicati. </li> <li>%Una scatola con un bordo grigio denota una non documentata classe struct o. </li> <li>%Una scatola con un bordo rosso denota una struttura documentata o classe per la quale si dimostra che non tutte le relazioni di ereditarietà / contenimento. %Un grafico viene troncato se non rientra nei limiti specificati. </i> </ul> Le frecce hanno il seguente significato: <ul> <li>%Una freccia blu scuro viene utilizzato per visualizzare una relazione eredità pubblico tra due classi. </li> <li>%Una freccia verde scuro è utilizzato per eredità protetta. </li> <li>%Una freccia di colore rosso scuro è utilizzato per l'ereditarietà privata. </li> <li>%Una freccia tratteggiata viola viene utilizzato se una classe è contenuto o utilizzato da un'altra classe. La freccia è etichettato con la variabile (s) attraverso la quale la classe a punta o struct è accessibile. </li> <li>% Una freccia tratteggiata gialla denota una relazione tra un'istanza modello e la classe template è stato istanziato da. La freccia è etichettata con i parametri del modello dell'istanza. </li> </ul>

# doxy-text
source: Examples
it: Esempi

# doxy-text
source: Related Pages
it: Pagine correlate

# doxy-text
source: The documentation for this enum was generated from the following files:
it: La documentazione per questa enumerazione è stata generata dai seguenti file:

# doxy-text
source: Extends class @1
it: Estende classe @1

# doxy-text
source: %1% Category Reference
it: %1% Categoria Consultazione

# doxy-text
source: Here is a list of all functions, variables, defines, enums, and typedefs with links to the documentation:
it: Ecco un elenco di tutte le funzioni, le variabili, definisce, enumerazioni, e typedef con collegamenti alla documentazione:

# doxy-text
source: Here is a list of all related documentation pages:
it: Ecco un elenco di tutte le pagine di documentazione correlati:

# doxy-text
source: Documentation
it: Documentazione

# doxy-text
source: %1% Constant Group Reference
it: %1% costante di riferimento del Gruppo
