Repository: klemens-morgenstern/doxygen
Catalog: translations/doxy_*.po
Languages: de, es, fr, it

# doxy-text
source: The documentation for this category was generated from the following files:
it: La documentazione per questa categoria è stata generata dai seguenti file:

# doxy-text
source: Go to the source code of this file.
it: Vai al codice sorgente di questo file.

# doxy-text
source: %1% Struct Reference
it: %1% Riferimenti per la struct

# doxy-text
source: enum value
it: valore enum

# doxy-text
source: The documentation for this type was generated from the following files:
it: La documentazione di questo tipo è stata generata dai seguenti file:

# doxy-text
source: Go to the textual class hierarchy
it: Vai alla gerarchia delle classi testuale

# doxy-text
source: Protected Typedefs
it: Typedef protette

# doxy-text
source: Here are the data types with brief descriptions:
it: Qui ci sono i tipi di dati con brevi descrizioni:

# doxy-text
source: Provided by category @1.
it: Fornito da categoria @1.

# doxy-text
source: %1% Namespace Reference
it: %1% Namespace riferimento

# doxy-text
source: Here is a list of all module members with links to the module documentation for each member:
it: Ecco un elenco di tutti i membri di moduli con collegamenti alla documentazione del modulo per ciascun membro:

# doxy-text
source: Here is a list of all data types members with links to the data types they belong to:
it: Ecco un elenco di tutti i membri i tipi di dati con link ai tipi di dati di cui fanno parte:

# doxy-text|
source: p,
de: S.

source: Bug
de: Fehler

source: The documentation for this singleton was generated from the following files:
de: Die Dokumentation für diese Singleton wurde aus den folgenden Dateien generiert:

# doxy-text|
source: Typedefs
de: Typdefinitionen

# doxy-text|
source: Macros
de: Makrodefinitionen

# doxy-text|
source: Variables
de: Variablen

# doxy-text|
source: Bug
fr: Bogue

# doxy-text|
source: Global
fr: Mondial

# doxy-text|
source: global
fr: mondial
