Repository: klemens-morgenstern/doxygen
Catalog: translations/doxy_*.po
Languages: de, es, fr, it

# doxy-text|
source: Found <b>$num</b> documents matching your query. Showing best matches first.
de: Gefunden <b>$num</b> Dokumente, die Ihrer Suchanfrage. Es werden zunächst die besten Übereinstimmungen.
es: Encontrado <b>$num</b> documentos que coincidan con su consulta. Mostrando los resultados más importantes primero.
fr: Trouvé <b>$num</b> documents correspondant à votre requête. Affichage meilleurs matchs du premier.

# doxy-text|
source: globals
de: global
es: globales

# doxy-text|
source: Globals
de: Datei-Elemente
es: Globales

# doxy-text|
source: Member Enumeration Documentation
de: Dokumentation der Aufzählungstypen
es: Documentación de las enumeraciones miembro de la clase
fr: Énumération membres Documentation

# doxy-text|
source: , including all inherited members.
de: einschließlich aller geerbten Elemente.
es: , incluyendo todos los heredados:
fr: , Y compris tous les membres hérités.

# doxy-text|
source: Related Functions
de: Verwandte Funktionen
es: Funciones relacionadas
fr: Fonctions associées

# doxy-text|
source: %1 Reference
de: %1 Bezugs
es: %1 Referencia
fr: %1 Référence

# doxy-text|
source: Protected Member Functions
de: Geschützte Methoden
es: Funciones miembros Protegidas
fr: Fonctions membres protégées

# doxy-text|
source: Here is a list of all documented module members with links to the modules they belong to:
de: Hier ist eine Liste aller dokumentierten Modulelemente mit Links zu den sie gehören Module:
es: Aquí está una lista de todos los miembros de módulo documentados con enlaces a los módulos a los que pertenecen:
fr: Voici une liste de tous les membres de module documentées avec des liens vers les modules auxquels ils appartiennent:

# doxy-text|
source: This page explains how to interpret the graphs which are generated by DoxyPress. Consider the following example: \code /*! Invisible class because of truncation */ class Invisible { }; /*! Truncated class, inheritance relation is hidden */ class Truncated : public Invisible { }; /* Class not documented with DoxyPress comments */ class Undocumented { }; /*! Class that is inherited using public inheritance */ class PublicBase : public Truncated { }; /*! A template class */ template<class T> class Templ { }; /*! Class that is inherited using protected inheritance */ class ProtectedBase { }; /*! Class that is inherited using private inheritance */ class PrivateBase { }; /*! Class that is used by the Inherited class */ class Used { }; /*! Super class that inherits a number of other classes */ class Inherited : public PublicBase, protected ProtectedBase, private PrivateBase, public Undocumented, public Templ<int> { private: Used *m_usedClass; }; \endcode This will result in the following graph: <center><img alt="" src="graph_legend.%1"></center> The boxes in the above graph have the following meaning: <ul> <li>%A filled gray box represents the struct or class for which the graph is generated.</li> <li>%A box with a black border denotes a documented struct or class.</li> <li>%A box with a grey border denotes an undocumented struct or class.</li> <li>%A box with a red border denotes a documented struct or class for which not all inheritance/containment relations are shown. %A graph is truncated if it does not fit within the specified boundaries.</li> </ul> The arrows have the following meaning: <ul> <li>%A dark blue arrow is used to visualize a public inheritance relation between two classes.</li> <li>%A dark green arrow is used for protected inheritance.</li> <li>%A dark red arrow is used for private inheritance.</li> <li>%A purple dashed arrow is used if a class is contained or used by another class. The arrow is labeled with the variable(s) through which the pointed class or struct is accessible.</li> <li>%A yellow dashed arrow denotes a relation between a template instance and the template class it was instantiated from. The arrow is labeled with the template parameters of the instance.</li> </ul>
de: Diese Seite erklärt, wie die Diagramme, die durch DoxyPress erzeugt werden interpretieren. Betrachten Sie das folgende Beispiel: \code /*! Invisible Klasse wegen der Verkürzung */ class Invisible {}; /*! Abgeschnittene Klasse wird Vererbungsbeziehung versteckt */ class abgeschnitten: public Invisible {}; /* Klasse nicht mit DoxyPress dokumentiert, kommentiert */ class Undocumented {}; /*! Klasse, die mit den öffentlichen Vererbung vererbt wird */ class PublicBase: public Truncated {}; /*! Eine Template-Klasse */ template<class T> class Templ {}; /*! Klasse, die unter Verwendung von geschützten Erbe vererbt wird */ class ProtectedBase {}; /*! Klasse, die mit dem privaten Erbe vererbt wird */ class PrivateBase {}; /*! Klasse, die von der vererbten Klasse verwendet wird */ class Used {}; /*! Super-Klasse, die eine Reihe von anderen Klassen erbt */ class Geerbte: public PublicBase, protected ProtectedBase, private PrivateBase, public Undocumented, public Templ <int> { private: Used * m_usedClass; }; \endcode Dies wird in der folgenden Grafik führen: <center><img alt="" src="graph_legend.%1"></center> Die Boxen in der obigen Grafik haben folgende Bedeutung: <ul> <li>%A gefüllt grauen Kasten stellt die Struktur oder Klasse, für die das Diagramm erzeugt wird. </li> <li>%Ein Feld mit einem schwarzen Rand bezeichnet eine dokumentierte Struktur oder Klasse. </li> <li>%A-Box mit einem grauen Rand bezeichnet eine nicht dokumentierte Struktur oder Klasse. </li> <li>%A-Box mit einem roten Rand bezeichnet eine dokumentierte Struktur oder Klasse, für die nicht alle Vererbung / Contain Beziehungen gezeigt. %Ein Graph wird abgeschnitten, wenn sie nicht innerhalb der festgelegten Grenzen zu passen. </li> </ul> Die Pfeile haben folgende Bedeutung: <ul> <li>%Ein dunkelblauer Pfeil wird verwendet, um eine öffentliche Vererbungsbeziehung zwischen zwei Klassen zu visualisieren. </li> <li>%Ein dunkelgrüner Pfeil für geschützte Vererbung verwendet. </li> <li>%Eine dunkle rote Pfeil ist für private Vererbung verwendet. </li> <li>%Ein lila gestrichelten Pfeil wird verwendet, wenn eine Klasse enthalten sind oder von einer anderen Klasse verwendet. Der Pfeil mit der Variablen (n), durch die das spitze Klasse oder Struktur zugänglich markiert. </li> <li>%A gelb gestrichelten Pfeil zeigt eine Beziehung zwischen einer Vorlageninstanz und die Template-Klasse wurde von instanziiert. Der Pfeil mit der Template-Parameter der Instanz bezeichnet. </li> </ul>
es: Esta página explica cómo interpretar los gráficos que se generan por DoxyPress. Considere el siguiente ejemplo: \code /*! Clase Invisible porque de truncamiento */ class Invisible { }; /*! Clase Truncado, relación de herencia se oculta */ class Truncated : public Invisible { }; /* La clase no documentado con DoxyPress comentarios */ class Undocumented { }; /*! Clase que se hereda mediante herencia pública */ class PublicBase : public Truncated { }; /*! Una clase de plantilla * / template<class T> class Templ { }; /*! Clase que se hereda mediante protegida herencia */ class ProtectedBase { }; class PrivateBase { }; /*! Clase que se utiliza por la clase heredada */ class Used { }; /*! Súper clase que hereda una serie de otras clases */ class Inherited : public PublicBase, protected ProtectedBase, private PrivateBase, public Undocumented, public Templ<int> { private: Used *m_usedClass; }; \endcode Esto resultará en el siguiente gráfico: <center><img alt="" src="graph_legend.%1"></center> Las cajas en el gráfico de arriba tienen el siguiente significado: <ul> <li>%Un cuadro gris llena representa la estructura o clase para el que se genera la gráfica. </li> <li>%Una caja con un borde negro denota una estructura o clase documentado. </li> <li>%Una caja con un borde gris indica un indocumentado clase struct o. </li> <li>%Una caja con un borde rojo denota una estructura o clase documentado para los que se muestran no todas las relaciones de herencia / contención. %Un gráfico se trunca si no encaja dentro de los límites especificados. </li> </ul> Las flechas tienen el siguiente significado: <ul> <li>%Una flecha azul oscuro se utiliza para visualizar una relación de herencia pública entre dos clases. </li> <li>%Una flecha de color verde oscuro se utiliza para la herencia protegida. </li> <li>%Una flecha de color rojo oscuro se utiliza para la herencia privada. </li> <li>%Una flecha de trazos de color púrpura se utiliza si una clase está contenida o utilizada por otra clase. La flecha se etiqueta con la variable (s) a través del cual la clase puntiagudo o struct es accesible. </li> <li>%Una flecha amarilla discontinua indica una relación entre una instancia de plantilla y la clase de plantilla se crea una instancia de. La flecha se etiqueta con los parámetros de plantilla de la instancia. </li> </ul>
fr: Cette page explique comment interpréter les graphiques qui sont générés par DoxyPress. Prenons l'exemple suivant: \code /*! Invisible classe en raison de la troncature */ class Invisible { }; /*! Classe tronqué, relation d'héritage est caché */ class Truncated : public Invisible { }; /* Classe non documentée avec DoxyPress commente */ class Undocumented { }; /*! Classe qui est dérivée par héritage publique */ class PublicBase : public Truncated { }; /*! Un modèle de classe * / template<class T> class Templ { }; /*! Classe qui est héritée en utilisant l'héritage protégé */ class ProtectedBase { }; /*! Classe qui est dérivée par héritage privé */ class PrivateBase { }; /*! Classe qui est utilisée par la classe Hérité */ class Used { }; /*! Super classe qui hérite d'un certain nombre d'autres classes */ class Inherited : public PublicBase, protected ProtectedBase, private PrivateBase, public Undocumented, public Templ<int> { private: Used *m_usedClass; }; \endcode Cela se traduira dans le graphique suivant: <center><img alt="" src="graph_legend.%1"></center> Les boîtes dans le graphique ci-dessus ont la signification suivante: <ul> <li>%Une boîte remplie de gris représente la structure ou classe pour laquelle le graphique est générée. </li> <li>%Une boîte avec une bordure noire désigne une structure ou une classe documentée. </li> <li>%Une boîte avec une bordure grise désigne une catégorie struct ou sans papiers. </li> <li>%Une boîte avec une bordure rouge désigne une structure ou une classe documentés pour lesquels ne sont pas tous des relations héritage / confinement sont présentés. %Un graphe est tronquée si elle ne rentre pas dans les limites spécifiées. </li> </ul> Les flèches ont la signification suivante: <ul> <li>%Une flèche bleue foncée est utilisée pour visualiser une relation d'héritage public entre deux classes. </li> <li>%Une flèche de couleur vert foncé est utilisé pour héritage protégé. </li> <li>%Une flèche rouge foncé est utilisé pour l'héritage privé. </li> <li>%Une flèche violette en pointillés est utilisé si une classe est contenue ou utilisée par une autre classe. La flèche est étiqueté avec la variable (s) à travers laquelle la classe pointue ou struct est accessible. </li> <li>%Une flèche en pointillé jaune dénote une relation entre une instance de modèle et de la classe de modèle, il a été instancié à partir. La flèche est marquée avec les paramètres du modèle de l'instance. </li> </ul>

# doxy-text|
source: Examples
de: Beispiele
es: Ejemplos
fr: Exemples

# doxy-text|
source: Related Pages
de: Zusätzliche Informationen
es: Páginas relacionadas
fr: Pages associées

# doxy-text|
source: The documentation for this enum was generated from the following files:
de: Die Dokumentation für diese Enumeration wurde aus den folgenden Dateien generiert:
es: La documentación para esta enumeración se genera a partir de los siguientes archivos:
fr: La documentation de cette énumération a été générée à partir des fichiers suivants:

# doxy-text|
source: Extends class @1
de: Erstreckt Klasse @1
es: Extiende la clase @1
fr: Étend la classe @1

# doxy-text|
source: %1 Category Reference
de: %1 Kategorie Reference
es: %1 Categoría Referencia
fr: %1 Catégorie de référence

# doxy-text|
source: Here is a list of all functions, variables, defines, enums, and typedefs with links to the documentation:
de: Hier folgt die Aufzählung aller Funktionen, Variablen, Makros, Aufzählungen und Typdefinitionen mit Verweisen auf die zugehörigen Dateien:
es: Aquí está una lista de todas las funciones, variables, define, enumeraciones y typedefs con enlaces a la documentación:
fr: Voici une liste de toutes les fonctions, variables, définit, énumérations, et typedefs avec des liens vers la documentation:

# doxy-text|
source: Here is a list of all related documentation pages:
de: Hier folgt eine Liste mit zusammengehörigen Themengebieten:
es: Aquí está una lista de todas las páginas de documentación relacionados:
fr: Voici une liste de toutes les pages de documentation liés:

# doxy-text|
source: Documentation
de: Dokumentation
es: Documentación

# doxy-text|
source: %1 Constant Group Reference
de: %1 Constant Gruppe Referenz
es: %1 Constante Grupo de Referencia
fr: %1 Constant Groupe de référence

# doxy-text|
source: The documentation for this category was generated from the following files:
de: Die Dokumentation für diese Klasse wurde aus den folgenden Dateien generiert:
es: La documentación para esta categoría se genera a partir de los siguientes archivos:
fr: La documentation de cette catégorie a été générée à partir des fichiers suivants:

# doxy-text|
source: Go to the source code of this file.
de: gehe zum Quellcode dieser Datei
es: Ir al código fuente de este archivo.
fr: Aller au code source de ce fichier.

# doxy-text|
source: %1 Struct Reference
de: %1 Strukturreferenz
es: %1 Struct Referencia
fr: %1 Référence de la structure

# doxy-text|
source: enum value
de: enum-Wert
es: valor enumerado
fr: valeur enum

# doxy-text|
source: The documentation for this type was generated from the following files:
de: Die Dokumentation für diese Art wurde aus den folgenden Dateien generiert:
es: La documentación de este tipo se genera a partir de los siguientes archivos:
fr: La documentation de ce type a été générée à partir des fichiers suivants:

# doxy-text|
source: Go to the textual class hierarchy
de: gehe zur textbasierten Darstellung der Klassenhierarchie
es: Ir a la jerarquía de clases textual
fr: Aller à la hiérarchie de classe textuelle

# doxy-text|
source: Protected Typedefs
de: Geschützte Typedefs
es: Typedefs Protegidas
fr: Typedefs protégées

# doxy-text|
source: Here are the data types with brief descriptions:
de: Datentyp-Index
es: Estos son los tipos de datos con una breve descripción:
fr: Voici les types de données avec une brève description:

# doxy-text|
source: Provided by category @1.
de: Nach Kategorie @1 zur Verfügung gestellt.
es: Ofrecido por categoría @1.
fr: Fourni par catégorie @1.

# doxy-text|
source: %1 Namespace Reference
de: %1-Namensbereichsreferenz
es: %1 Referencia Espacio de nombres
fr: %1 espace de noms de référence

# doxy-text|
source: Here is a list of all module members with links to the module documentation for each member:
de: Hier ist eine Liste aller Modulelemente mit Verweisen auf das Modul-Dokumentation für jedes Mitglied:
es: Aquí está una lista de todos los miembros de módulo con enlaces a la documentación del módulo para cada miembro:
fr: Voici une liste de tous les membres de module avec des liens vers la documentation du module pour chaque membre:

# doxy-text|
source: Here is a list of all data types members with links to the data types they belong to:
de: Hier ist eine Liste aller Datentypen Mitglieder mit Links zu den Datentypen, denen sie angehören:
es: Aquí está una lista de todos los tipos de datos miembros con enlaces a los tipos de datos que pertenecen a:
fr: Voici une liste de tous les types de données membres avec des liens vers les types de données auxquels ils appartiennent:

# doxy-text
source: All
it: Tutti

# doxy-text
source: Bug
it: Insetto

# doxy-text
source: The documentation for this singleton was generated from the following files:
it: La documentazione per questa Singleton è stata generata dai seguenti file:

# doxy-text
source: Date
it: Data

# doxy-text
source: Main Page
it: Pagina Principale

# doxy-text
source: Note
it: Nota

# doxy-text
source: Page
it: Pagina

# doxy-text
source: Test
it: Prova

# doxy-text
source: Todo
it: Da Fare

# doxy-text
source: Type
it: Tipo

# doxy-text
source: %1% Service Reference
it: %1% Servizio di riferimento

# doxy-text
source: code
it: codice

# doxy-text
source: page
it: pagina

# doxy-text
source: type
it: tipo

# doxy-text
source: Definition in file @0.
it: Definizione in file di @0.

# doxy-text
source: Public Types
it: Tipi pubblici

# doxy-text
source: Public Slots
it: Slot pubblici

# doxy-text
source: The documentation for this interface was generated from the following file:
it: La documentazione di questa interfaccia è stata generata dal seguente file:

# doxy-text
source: Class
it: Classe

# doxy-text
source: Enums
it: Enumerazioni

# doxy-text
source: Files
it: File

# doxy-text
source: defined in
it: definito

# doxy-text
source: Index
it: Indice

# doxy-text
source: Pages
it: Pagine

# doxy-text
source: Since
it: Da

# doxy-text
source: Types
it: Tipi

# doxy-text
source: class
it: classe

# doxy-text
source: Typedefs
it: Typedef

# doxy-text
source: files
it: file

# doxy-text
source: Here is a list of all documented namespace members with links to the namespaces they belong to:
it: Ecco un elenco di tutti i membri dello spazio dei nomi documentati con link ai namespace a cui appartengono:

# doxy-text
source: pages
it: pagine

# doxy-text
source: types
it: Tipi

# doxy-text
source: Member Typedef Documentation
it: Gli Typedef Documentazione

# doxy-text
source: This graph shows which files directly or indirectly include this file
it: Questo grafico mostra che i file direttamente o indirettamente includono questo file

# doxy-text
source: The documentation for this interface was generated from the following file:
it: La documentazione di questa interfaccia è stata generata dal seguente file:

# doxy-text
source: The documentation for this protocol was generated from the following files:
it: La documentazione di questo protocollo è stata generata dai seguenti file:

# doxy-text
source: Private Slots
it: Slot privati

# doxy-text
source: Private Types
it: Tipi privati

# doxy-text
source: Package Attributes
it: Attributi della confezione

# doxy-text
source: Protected Types
it: Tipi protette

# doxy-text
source: Protected Slots
it: Slot protette

# doxy-text
source: This is an overloaded member function, provided for convenience. It differs from the above function only in what argument(s) it accepts.
it: Questa è una funzione membro sovraccaricato, previsto per convenienza. Essa differisce dalla funzione precedente solo in quanto argomento (s) accetta.

# doxy-text
source: Data Structure Documentation
it: Struttura dati Documentazione

# doxy-text
source: Modules Index
it: Moduli Index

# doxy-text
source: Directory Hierarchy
it: Directory Gerarchia

# doxy-text
source: Package Types
it: Tipi di pacchetti

# doxy-text
source: Found <b>1</b> document matching your query.
it: Trovato <b>1</b> documento corrisponde alla tua richiesta.

# doxy-text
source: Constant Groups
it: Gruppi Constant

# doxy-text
source: Namespace List
it: Lista dei nomi

# doxy-text
source: %1% Directory Reference
it: %1% Directory di riferimento

# doxy-text
source: Bibliography
it: Bibliografia

# doxy-text
source: Package %1%
it: Pacchetto %1%

# doxy-text
source: The documentation for this union was generated from the following file:
it: La documentazione di questa unione è stata generata dal seguente file:

# doxy-text
source: Data Structures
it: Strutture dati

# doxy-text
source: Here is a list of all examples:
it: Ecco un elenco di tutti gli esempi:

# doxy-text
source: The documentation for this exception was generated from the following files:
it: La documentazione per questa eccezione è stata generata da i seguenti file:

# doxy-text
source: Graph Legend
it: Grafico leggenda

# doxy-text
source: Implements %1%.
it: Implementa %1%.

# doxy-text
source: Precondition
it: Condizione indispensabile

# doxy-text
source: %1% Protocol Reference
it: %1% Protocollo di riferimento

# doxy-text
source: %1% Protocol Reference
it: %1% Protocollo di riferimento

# doxy-text
source: Protected Signals
it: Segnali protetti

# doxy-text
source: The documentation for this class was generated from the following files:
it: La documentazione per questa classe è stata generata dai seguenti file:

# doxy-text
source: Module Index
it: Dell'indice dei moduli

# doxy-text
source: Field Documentation
it: Campo Documentazione

# doxy-text
source: %1% inherited from %2%
it: %1% ereditato dal %2%

# doxy-text
source: The documentation for this module was generated from the following files:
it: La documentazione di questo modulo è stato generato dai seguenti file:

# doxy-text
source: %1% Union Reference
it: %1% di riferimento dell'Unione

# doxy-text
source: Event Documentation
it: Documentazione Evento

# doxy-text
source: Hierarchical Index
it: Indice gerarchica

# doxy-text
source: The documentation for this union was generated from the following file:
it: La documentazione di questa unione è stata generata dal seguente file:

# doxy-text
source: Definition at line @0 of file @1.
it: Definizione alla linea @0 di file di @1.

# doxy-text
source: Static Protected Attributes
it: Attributi protetti statici

# doxy-text
source: Function/Subroutine Documentation
it: Funzione / subroutine Documentazione

# doxy-text
source: Method Documentation
it: Metodo Documentazione

# doxy-text
source: Here are the data structures with brief descriptions:
it: Qui ci sono le strutture di dati con brevi descrizioni:

# doxy-text
source: Public Signals
it: Segnali pubblici

# doxy-text
source: File List
it: Elenco file

# doxy-text
source: This directory hierarchy is sorted roughly, but not completely, alphabetically:
it: Questa gerarchia di directory è ordinato o meno, ma non completamente, in ordine alfabetico:

# doxy-text
source: %1% Type Template Reference
it: %1% tipo di modello di riferimento

# doxy-text
source: Enumerator Documentation
it: Enumeratore Documentazione

# doxy-text
source: Initial value:
it: valore iniziale:

# doxy-text
source: Inheritance diagram for %1%:
it: Schema di ereditarietà per %1%:

# doxy-text
source: , and
it: E

# doxy-text
source: Go to the graphical class hierarchy
it: Andare alla gerarchia delle classi grafica

# doxy-text
source: Here is a list of all documented data types members with links to the data structure documentation for each member:
it: Ecco un elenco di tutti i tipi di dati documentati membri con collegamenti alla documentazione struttura di dati per ogni membro:

# doxy-text
source: The documentation for this singleton was generated from the following file:
it: La documentazione per questa Singleton è stata generata dal seguente file:

# doxy-text
source: Collaboration diagram for %1%:
it: Diagramma di collaborazione per %1%:

# doxy-text
source: Here is a list of all documented struct and union fields with links to the struct/union documentation for each field:
it: Ecco un elenco di tutti i campi struct e sindacali documentati con collegamenti alla documentazione struct / union per ogni campo:

# doxy-text
source: Table of Contents
it: sommario

# doxy-text
source: Package Functions
it: Funzioni Pacchetto

# doxy-text
source: Sorry, no documents matching your query.
it: Ci dispiace, non corrisponde alla tua richiesta.

# doxy-text
source: The documentation for this category was generated from the following files:
it: La documentazione per questa categoria è stata generata dai seguenti file:
